#Область ОбработчикиСобытийФормы

&НаКлиенте
Процедура ПериодПриИзменении(Элемент)
	
	Объект.Период.ДатаНачала = НачалоМесяца(Объект.Период.ДатаНачала);
	Объект.Период.ДатаОкончания = НачалоМесяца(Объект.Период.ДатаОкончания);
	
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Асинх Процедура СоздатьДокументы(Команда)
	
	Если Не ЗначениеЗаполнено(Объект.Период) Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю("Период не заполнен");
		Возврат;
		
	КонецЕсли;      

    Ответ = ВопросАсинх("Табличная часть будет очищена, продолжить?", РежимДиалогаВопрос.ДаНетОтмена);

    Если Ответ = КодВозвратаДиалога.Да Тогда
      
	    ФоноваяОперация = СозданиеРеализаций();
		ПараметрыОжидания = ДлительныеОперацииКлиент.ПараметрыОжидания(ЭтотОбъект);
		Оповещение = Новый ОписаниеОповещения("ФормированиеРеализаций", ЭтотОбъект);
		ДлительныеОперацииКлиент.ОжидатьЗавершение(ФоноваяОперация, Оповещение, ПараметрыОжидания);
      
    КонецЕсли; 
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

&НаСервере
Функция СозданиеРеализаций()
	
	ПараметрыВыполнения = ДлительныеОперации.ПараметрыВыполненияФункции(УникальныйИдентификатор);
	
	Возврат ДлительныеОперации.ВыполнитьВФоне(ПараметрыВыполнения, "Обработки.ВКМ_МассовоеСозданиеАктов.СоздатьДокументы",
		Объект.Период);
	
КонецФункции

&НаКлиенте
Процедура ФормированиеРеализаций(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат.Статус = "Ошибка" Тогда
		
		ОбщегоНазначенияКлиент.СообщитьПользователю(Результат.ПодробноеПредставлениеОшибки);
		Возврат;
		
	КонецЕсли;
			
	РезультатОбработки = ПолучитьИзВременногоХранилища(Результат.АдресРезультата);
	
	Объект.СписокДоговоровИРеализаций.Очистить();
	
	ВывестиРеализацииВТЧ(РезультатОбработки.МассивДоговоровИРеализаций);
	
КонецПроцедуры

&НаКлиенте
Процедура ВывестиРеализацииВТЧ(МассивРеализаций)
	
	Для Каждого ЭлементМассива Из МассивРеализаций Цикл 
		
		СтрокаСписка = Объект.СписокДоговоровИРеализаций.Добавить();
		ЗаполнитьЗначенияСвойств(СтрокаСписка, ЭлементМассива);
	
	КонецЦикла
	
КонецПроцедуры

#КонецОбласти
